archive/before-2018-11-10/2017-06-20-use-tig-with-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>结合tig使用emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pengpengxp" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">结合tig使用emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org320f0e5">1. 做一点简单的配置先</a></li>
<li><a href="#org5a348dc">2. grep view(g)</a></li>
<li><a href="#orgeb169e6">3. status view(s)</a></li>
<li><a href="#org75323a6">4. 配置tig的补全</a></li>
</ul>
</div>
</div>
<p>
emacs中已经有了 <code>magit</code> <code>helm-ag</code> <code>counsel-ag</code> 等很多好用的东西了。但
是有时候我还是推荐 <a href="https://github.com/jonas/tig">tig</a> 这个工具。推荐理由就是一个字：快。做一些简单的
配置后，用起来还是很不错的。
</p>

<div id="outline-container-org320f0e5" class="outline-2">
<h2 id="org320f0e5"><span class="section-number-2">1</span> 做一点简单的配置先</h2>
<div class="outline-text-2" id="text-1">
<p>
tig可认通过edit命令直接调出编辑器来编辑对应行的文件。我希望配置成emacs
来编辑。默认是使用git的默认编辑器。对于tig，可以通过设置 <code>GIT_EDITOR</code>
环境变量来实现。把下面这句话写到 <code>~/.bashrc</code> 就可以了。
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #d18aff;">alias</span> <span style="color: #ff8700;">tig</span>=<span style="color: #ff4ea3;">'GIT_EDITOR="emacsclient --no-wait" tig'</span>
</pre>
</div>

<p>
配置好编辑器后，在tig中直接使用 <code>e</code> 就可以调用Emacs来编辑对应文件的对
应行了。这样配置后，结合后面tig的各种view，可以精准地定位到文件的某行
然后使用emacs打开它。
</p>

<p>
默认的tig配置文件在 <code>~/.tigrc</code> ，我只做了很少一些配置：
</p>
<pre class="example">
  bind generic 1 move-first-line
  bind generic 2 move-last-line
  bind main 1 move-first-line
  bind main 2 move-last-line

  # can exec git command
  #bind status b !git branch

  bind status r refresh

  # Change grep view to be similar to `git grep` format
  set grep-view = file-name:yes line-number:yes,interval=1 text
</pre>
<p>
由于 <code>g</code> 默认绑到tig的 <code>grep views</code> 。所以我把1和2分别绑定到跳转到第一
行和最后一行。怎么写配置可以参考 <a href="http://jonas.nitro.dk/tig/tigrc.5.html">这里</a> 。
</p>

<p>
接下来讲一下tig中的两个我常用的view。
</p>
</div>
</div>

<div id="outline-container-org5a348dc" class="outline-2">
<h2 id="org5a348dc"><span class="section-number-2">2</span> grep view(g)</h2>
<div class="outline-text-2" id="text-2">
<p>
grep整个git工程。非常快。默认绑到 <code>g</code> 上。按下 <code>g</code> 后，输入 <code>test</code>
，会把全部包含 <code>test</code> 的行全部找出来。
</p>

<p>
它支持vim like的search操作。可以使用 <code>/</code> <code>n,N</code> 来在结果中继续搜索。
</p>

<p>
我觉得它的好处是 <code>regexp</code> 是我比较熟悉的。不像有时候在打开 <code>helm-ag</code>
或者 <code>counsel-ag</code> ，我不知道怎么样才能正确区配。
</p>
</div>
</div>

<div id="outline-container-orgeb169e6" class="outline-2">
<h2 id="orgeb169e6"><span class="section-number-2">3</span> status view(s)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>R</code>: refresh</li>
<li><code>u</code>: 在unstage和stage状态中切换，对于同一文件，
<code>unstage-&gt;staged</code> 会覆盖stage中的内容，应该是 <code>git add</code> 操作。
<code>staged-&gt;unstage</code> ，会保留 unstage状态中的内容，应该是调用了
<code>git reset HEAD &lt;filename&gt;</code></li>
<li><code>!</code>: 只能作用于unstaged的modified状态的文件。 <code>git checkout --
    &lt;filename&gt;</code> 。</li>
<li class="off"><code>[&#xa0;]</code> <code>C</code>: commit。但是我这样设置了编辑器后，就没法在tig中commit了。
还有点问题。commit还是自己用命令来搞吧。</li>
</ul>
</div>
</div>

<div id="outline-container-org75323a6" class="outline-2">
<h2 id="org75323a6"><span class="section-number-2">4</span> 配置tig的补全</h2>
<div class="outline-text-2" id="text-4">
<p>
参考代码中的 <code>tig-completion.zsh</code> 文件：
</p>
<pre class="example">
    #compdef tig
    #
    # zsh completion wrapper for tig
    # ==============================
    #
    # You need to install this script to zsh fpath with tig-completion.bash.
    #
    # The recommended way to install this script is to copy this and tig-completion.bash
    # to '~/.zsh/_tig' and '~/.zsh/tig-completion.bash' and
    # then add following to your ~/.zshrc file:
    #
    #  fpath=(~/.zsh $fpath)


    _tig () {
      local e
      e=$(dirname ${funcsourcetrace[1]%:*})/tig-completion.bash
      if [ -f $e ]; then
        . $e
      fi
    }
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pengpengxp</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>